app/controllers/api/v1/orders_controller.rb

	def index
		orders = current_user.orders.page(params[:page]).per(params[:per_page])
---
SELECT "orders".* FROM "orders"  WHERE "orders"."user_id" = ?  [["user_id", 1]]

	def show
		respond_with current_user.orders.find(params[:id])
---
SELECT  "orders".* FROM "orders"  WHERE "orders"."user_id" = ? AND "orders"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]

	def create
		order = current_user.orders.build
		order.build_placements_with_products_ids_and_quantities(params[:order][:product_ids_and_quantities])

		if order.save
---
INSERT INTO "orders" ("created_at", "total", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2017-03-01 16:54:43.770414"], ["total", 50.0], ["updated_at", "2017-03-01 16:54:43.770414"], ["user_id", 1]]
INSERT INTO "placements" ("created_at", "order_id", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2017-03-01 16:54:43.771605"], ["order_id", 1], ["product_id", 1], ["updated_at", "2017-03-01 16:54:43.771605"]]