app/controllers/api/v1/products_controller.rb

	def index
		products = Product.search(params).page(params[:page]).per(params[:per_page])
---
SELECT  "products".* FROM "products"  LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "products"

	def show
		respond_with Product.find(params[:id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 16]]

	def create
		product = current_user.products.build(product_params)
		if product.save
---
INSERT INTO "products" ("created_at", "price", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2017-02-28 20:52:30.714120"], ["price", 37.57548905742273], ["title", "Power Bracket"], ["updated_at", "2017-02-28 20:52:30.714120"], ["user_id", 1]]

	def update
		product = current_user.products.find(params[:id])
		if product.update(product_params)
---
SELECT  "products".* FROM "products"  WHERE "products"."user_id" = ? AND "products"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["title", "An expensive TV"], ["updated_at", "2017-02-28 21:27:50.418585"]]

	def destroy
		product = current_user.products.find(params[:id])
		product.destroy
---
SELECT  "products".* FROM "products"  WHERE "products"."user_id" = ? AND "products"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]