app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'lashawnda.damore@spinkanader.ca' LIMIT 1
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "last_sign_in_ip" = ?, "current_sign_in_ip" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = 1
---
	def create
		user_password = params[:session][:password]
		user_email = params[:session][:email]
		user = user_email.present? && User.find_by(email: user_email)

		if user.valid_password? user_password
			  sign_in user
			  user.generate_authentication_token!
			  user.save

SELECT "users".* FROM "users" WHERE "users"."auth_token" = 'FEQa9_Cv4zCy5rx86vqn' LIMIT 1
UPDATE "users" SET "auth_token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["auth_token", "9Da2k4HhwV9TSWyELG-q"], ["updated_at", Mon, 27 Feb 2017 21:21:45 UTC +00:00]]
---
	def destroy
		user = User.find_by(auth_token: params[:id])
		user.generate_authentication_token!
		user.save