app/controllers/api/v1/users_controller.rb

	def create
		user = User.new(user_params)
		if user.save
---
INSERT INTO "users" ("auth_token", "created_at", "email", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?, ?)

	def update
		user = current_user

		if user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "newmail@example.com"], ["updated_at", Wed, 22 Feb 2017 23:49:28 UTC +00:00]]

	def destroy
		user = current_user
		user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]